In [36]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import warnings
warnings.filterwarnings('ignore')

In [37]:
df = pd.read_csv("cardekho_dataset.csv")
df.head()

,Unnamed: 0,car_name,brand,model,vehicle_age,km_driven,seller_type,fuel_type,transmission_type,mileage,engine,max_power,seats,selling_price
0,0,Maruti Alto,Maruti,Alto,9,120000,Individual,Petrol,Manual,19.70,796,46.30,5,120000
1,1,Hyundai Grand,Hyundai,Grand,5,20000,Individual,Petrol,Manual,18.90,1197,82.00,5,550000
2,2,Hyundai i20,Hyundai,i20,11,60000,Individual,Petrol,Manual,17.00,1197,80.00,5,215000
3,3,Maruti Alto,Maruti,Alto,9,37000,Individual,Petrol,Manual,20.92,998,67.10,5,226000
4,4,Ford Ecosport,Ford,Ecosport,6,30000,Dealer,Diesel,Manual,22.77,1498,98.59,5,570000

In [38]:
df.isnull().sum()

Unnamed: 0           0
car_name             0
brand                0
model                0
vehicle_age          0
km_driven            0
seller_type          0
fuel_type            0
transmission_type    0
mileage              0
engine               0
max_power            0
seats                0
selling_price        0
dtype: int64

In [39]:
df.drop("Unnamed: 0" , axis = 1, inplace= True)

In [40]:
df.drop("car_name", axis = 1, inplace= True)

In [41]:
df.head()

,brand,model,vehicle_age,km_driven,seller_type,fuel_type,transmission_type,mileage,engine,max_power,seats,selling_price
0,Maruti,Alto,9,120000,Individual,Petrol,Manual,19.70,796,46.30,5,120000
1,Hyundai,Grand,5,20000,Individual,Petrol,Manual,18.90,1197,82.00,5,550000
2,Hyundai,i20,11,60000,Individual,Petrol,Manual,17.00,1197,80.00,5,215000
3,Maruti,Alto,9,37000,Individual,Petrol,Manual,20.92,998,67.10,5,226000
4,Ford,Ecosport,6,30000,Dealer,Diesel,Manual,22.77,1498,98.59,5,570000

In [42]:
df.drop("brand", axis = 1, inplace= True)

In [43]:
df.head()

,model,vehicle_age,km_driven,seller_type,fuel_type,transmission_type,mileage,engine,max_power,seats,selling_price
0,Alto,9,120000,Individual,Petrol,Manual,19.70,796,46.30,5,120000
1,Grand,5,20000,Individual,Petrol,Manual,18.90,1197,82.00,5,550000
2,i20,11,60000,Individual,Petrol,Manual,17.00,1197,80.00,5,215000
3,Alto,9,37000,Individual,Petrol,Manual,20.92,998,67.10,5,226000
4,Ecosport,6,30000,Dealer,Diesel,Manual,22.77,1498,98.59,5,570000

In [44]:
df.drop('model', axis = 1, inplace= True)

In [45]:
df.head()

,vehicle_age,km_driven,seller_type,fuel_type,transmission_type,mileage,engine,max_power,seats,selling_price
0,9,120000,Individual,Petrol,Manual,19.70,796,46.30,5,120000
1,5,20000,Individual,Petrol,Manual,18.90,1197,82.00,5,550000
2,11,60000,Individual,Petrol,Manual,17.00,1197,80.00,5,215000
3,9,37000,Individual,Petrol,Manual,20.92,998,67.10,5,226000
4,6,30000,Dealer,Diesel,Manual,22.77,1498,98.59,5,570000

In [46]:
df['seller_type'].unique()

array(['Individual', 'Dealer', 'Trustmark Dealer'], dtype=object)

In [47]:
df['seller_type'].replace("Individual",1, inplace= True)
df['seller_type'].replace("Dealer",2, inplace= True)
df['seller_type'].replace("Trustmark Dealer",3, inplace= True)

In [48]:
df.head()

,vehicle_age,km_driven,seller_type,fuel_type,transmission_type,mileage,engine,max_power,seats,selling_price
0,9,120000,1,Petrol,Manual,19.70,796,46.30,5,120000
1,5,20000,1,Petrol,Manual,18.90,1197,82.00,5,550000
2,11,60000,1,Petrol,Manual,17.00,1197,80.00,5,215000
3,9,37000,1,Petrol,Manual,20.92,998,67.10,5,226000
4,6,30000,2,Diesel,Manual,22.77,1498,98.59,5,570000

In [49]:
df['seller_type']

0        1
1        1
2        1
3        1
4        2
        ..
15406    2
15407    2
15408    2
15409    2
15410    2
Name: seller_type, Length: 15411, dtype: int64

In [50]:
df['fuel_type'].unique()

array(['Petrol', 'Diesel', 'CNG', 'LPG', 'Electric'], dtype=object)

In [51]:
df['fuel_type'].replace("Petrol",1, inplace= True)
df['fuel_type'].replace("Diesel",12, inplace= True)
df['fuel_type'].replace("CNG",3, inplace= True)
df['fuel_type'].replace("LPG",4, inplace= True)
df['fuel_type'].replace("Electric",5, inplace= True)

In [52]:
df.head()

,vehicle_age,km_driven,seller_type,fuel_type,transmission_type,mileage,engine,max_power,seats,selling_price
0,9,120000,1,1,Manual,19.70,796,46.30,5,120000
1,5,20000,1,1,Manual,18.90,1197,82.00,5,550000
2,11,60000,1,1,Manual,17.00,1197,80.00,5,215000
3,9,37000,1,1,Manual,20.92,998,67.10,5,226000
4,6,30000,2,12,Manual,22.77,1498,98.59,5,570000

In [53]:
df['transmission_type'].unique()

array(['Manual', 'Automatic'], dtype=object)

In [54]:
df['transmission_type'].replace("Manual",1,inplace= True)
df['transmission_type'].replace("Automatic",2,inplace= True)

In [55]:
df.head()

,vehicle_age,km_driven,seller_type,fuel_type,transmission_type,mileage,engine,max_power,seats,selling_price
0,9,120000,1,1,1,19.70,796,46.30,5,120000
1,5,20000,1,1,1,18.90,1197,82.00,5,550000
2,11,60000,1,1,1,17.00,1197,80.00,5,215000
3,9,37000,1,1,1,20.92,998,67.10,5,226000
4,6,30000,2,12,1,22.77,1498,98.59,5,570000

In [56]:
Annual_DF = df

In [57]:
Annual_DF

,vehicle_age,km_driven,seller_type,fuel_type,transmission_type,mileage,engine,max_power,seats,selling_price
0,9,120000,1,1,1,19.70,796,46.30,5,120000
1,5,20000,1,1,1,18.90,1197,82.00,5,550000
2,11,60000,1,1,1,17.00,1197,80.00,5,215000
3,9,37000,1,1,1,20.92,998,67.10,5,226000
4,6,30000,2,12,1,22.77,1498,98.59,5,570000
...,...,...,...,...,...,...,...,...,...,...
15406,9,10723,2,1,1,19.81,1086,68.05,5,250000
15407,2,18000,2,1,1,17.50,1373,91.10,7,925000
15408,6,67000,2,12,1,21.14,1498,103.52,5,425000
15409,5,3800000,2,12,1,16.00,2179,140.00,7,1225000
15410,2,13000,2,1,2,18.00,1497,117.60,5,1200000

In [58]:
df.dtypes

vehicle_age            int64
km_driven              int64
seller_type            int64
fuel_type              int64
transmission_type      int64
mileage              float64
engine                 int64
max_power            float64
seats                  int64
selling_price          int64
dtype: object